urlSeqMeta = 'https://genome.crie.ru/list/page-items'
urlSeqCount = 'https://genome.crie.ru/list/count'
pageSize = 1000
headers = {'Authorization': "Bearer bdcf09ac54d663cf154550f26b66229d34af2f8dc52827b1f9568eb05f9e82c7"}
params = {'page_size' : pageSize, 'page_id': 0}
DBparam = {
            "host" : "rc1b-9y7za9y2712fpiyf.mdb.yandexcloud.net",
            "user" : "sinev",
            "password" : "55sXt25ckd",
            "port" : 6432,
            "dbname" : "datalens"
        }


columnSourceNames = [
    "internal_number",
    "formValue.sample_pick_date.value",
    "pangolinResult.lineage",
    "parusResult.foundType.name",
    "file.created_at",
    ]

geoLoc = [
    "federalDistrict.name_ru",
    "region.name_ru"
        ]

colToCol = {
        "internal_number" : "vgarusId",
        "formValue.sample_pick_date.value" : "pickDate",
        "file.created_at" : "loadDate",
        "federalDistrict.name_ru" : "federal",
        "region.name_ru" : "region",
        "pangolinResult.lineage" : "pango",
        "parusResult.foundType.name" : "parus"
        }


regions = [
 'Алтайский край',
 'Амурская область',
 'Архангельская область',
 'Астраханская область',
 'Белгородская область',
 'Брянская область',
 'Владимирская область',
 'Волгоградская область',
 'Вологодская область',
 'Воронежская область',
 'г Москва',
 'г Санкт-Петербург',
 'г Севастополь',
 'Еврейская область',
 'Забайкальский край',
 'Ивановская область',
 'Иркутская область',
 'Калининградская область',
 'Калужская область',
 'Камчатский край',
 'Кемеровская область - Кузбасс',
 'Кировская область',
 'Костромская область',
 'Краснодарский край',
 'Красноярский край',
 'Курганская область',
 'Курская область',
 'Ленинградская область',
 'Липецкая область',
 'Магаданская область',
 'Московская область',
 'Мурманская область',
 'Нижегородская область',
 'Новгородская область',
 'Новосибирская область',
 'Омская область',
 'Оренбургская область',
 'Орловская область',
 'Пензенская область',
 'Пермский край',
 'Приморский край',
 'Псковская область',
 'Республика Адыгея',
 'Республика Алтай',
 'Республика Башкортостан',
 'Республика Бурятия',
 'Республика Дагестан',
 'Республика Ингушетия',
 'Республика Кабардино-Балкарская',
 'Республика Калмыкия',
 'Республика Карачаево-Черкесская',
 'Республика Карелия',
 'Республика Коми',
 'Республика Крым',
 'Республика Марий Эл',
 'Республика Мордовия',
 'Республика Саха /Якутия/',
 'Республика Северная Осетия - Алания',
 'Республика Татарстан',
 'Республика Тыва',
 'Республика Удмуртская',
 'Республика Хакасия',
 'Республика Чеченская',
 'Республика Чувашия',
 'Ростовская область',
 'Рязанская область',
 'Самарская область',
 'Саратовская область',
 'Сахалинская область',
 'Свердловская область',
 'Смоленская область',
 'Ставропольский край',
 'Тамбовская область',
 'Тверская область',
 'Томская область',
 'Тульская область',
 'Тюменская область',
 'Ульяновская область',
 'Хабаровский край',
 'Ханты-Мансийский Автономный округ - Югра',
 'Челябинская область',
 'Чукотский АО',
 'Ямало-Ненецкий АО',
 'Ярославская область',
 'Ненецкий АО']

